{"name":"Pankaj Israni","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Pankaj Israni - Curious","headerTaglineThree":"Designed & Developer","headerTaglineFour":" based in Rajasthan, India.","showCursor":true,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/1-Pankaj"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/pankaj-israni/"},{"id":"3","title":"Twitter","link":"https://twitter.com/idkpankaj"},{"id":"4","title":"Blog","link":"https://codeloom.co.in/blog"},{"id":"5","title":"Email","link":"mailto:pankajisrani17@gmail.com"}],"projects":[{"id":"5681f2e0-d737-4bde-8dbb-0f9369f2b015","title":"Noted! - Awesome Minimalistic Notes App","description":"Introducing Noted!, the versatile notes app designed to elevate your note-taking experience with powerful features, seamless performance, and a user-centric design. Whether you're a student, professional, or someone who loves staying organized, Noted! has everything you need to keep your notes in perfect order.","imageSrc":"https://i.ibb.co/XYd3cnt/Frame-3315.png","url":"https://codeloom.co.in/blog/noted"},{"id":"58b336b7-dbd0-4409-b97b-53ab6eee3a3f","title":"Cloud Notes","description":"Cloud Notes is a multi-platform note taking application with some advanced features for better organising of notes and increase efficiency in day to day tasks. Cloud Notes is an Android project built with React-Native based on a Note taking app with some extended features like Cloud syncing, In-App Extensions, Task Management with built-in UI customization","imageSrc":"https://i.ibb.co/S5079WQ/Frame-3316.png","url":"https://codeloom.co.in/blog/cloud-notes"}],"services":[{"id":"1","title":"Android Development","description":"End-to-end Android app development using Java, Kotlin, and modern frameworks."},{"id":"2","title":"UI/UX Design","description":"Crafting intuitive and appealing user interfaces with Figma."},{"id":"3","title":"Web Development","description":"Creating responsive and dynamic websites using modern web technologies, ensuring a seamless user experience across devices."},{"id":"4","title":"React Native Development","description":"Cross-platform mobile app development with React Native, delivering high-performance apps for both Android and iOS."},{"id":"8989f7da-4135-4dca-8ee5-44552382e54c","title":"Firebase Solutions","description":" Expertise in Firebase for real-time database management and cloud storage."},{"id":"e95234f3-defa-48b8-a4d4-93014f5994b7","title":"API Integration","description":"Seamlessly integrating third-party APIs for enhanced app functionality."}],"aboutpara":"I am Pankaj Israni, an experienced Android Developer based in Jodhpur, Rajasthan. With a strong background in Java, Kotlin, and React Native, I specialize in developing intuitive and efficient mobile applications. My portfolio includes projects like the Tech-Fly Online Exam app and the Cloud Notes app and Noted! App, where I focus on delivering high-quality, user-centric solutions. I am committed to continuous learning and innovation, always striving to enhance the user experience. When I'm not working on development, I enjoy reading and networking to broaden my perspectives.","resume":{"tagline":"React Native || Android || NextJS || Figma","description":"Highly motivated and skilled Android Developer with hands-on experience in designing and building robust mobile applications. Proficient in Java, Kotlin, and React Native, with a strong understanding of modern development frameworks and UI/UX design principles. Demonstrated success in delivering high-quality apps, including the Tech-Fly Online Exam App and Cloud Notes App. Adept at integrating APIs, managing databases with Firebase, and using tools like Android Studio and Figma to create user-focused solutions. A quick learner with a passion for continuous improvement, seeking to contribute expertise to dynamic projects and forward-thinking teams.","experiences":[{"id":"1","dates":"May 2024 - Present","type":"Full Time","position":"React Native & Android Developer at Pearl Organisation","bullets":"Developed mobile applications using React Native and Android.,Integrated third-party APIs to enhance app features."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"November 2022 - April 2023","type":"Internship","position":"Android Developer Intern at TechFly IT Solutions","bullets":"Worked on the Online Examination App., Managed app functionalities using Firebase."}],"education":{"universityName":"MCA - Rajasthan Technical University","universityDate":"2023 - 2025","universityPara":"Pursuing Master of Computer Applications, focusing on advanced mobile development and software engineering."},"languages":["Java","Kotlin","Javascript","HTML","CSS"],"frameworks":["React Native","Typescript","NodeJs","Jetpack Compose"],"others":["Figma","Firebase","MySQL","MongoDB"]}}